benchmarks/healthcare/mcpeval.yaml
$schema: ../../schema/mcpeval.config.schema.json
name: Healthcare Server Test Generation
description: Configuration for generating tests for the custom healthcare MCP server
mcp:
  servers:
    health_server:
      transport: stdio
      command: uv
      args:
      - run
      - health_server.py
      env:
        UV_NO_PROGRESS: '1'
        FDA_API_KEY: ${FDA_API_KEY}
        PUBMED_API_KEY: ${PUBMED_API_KEY}
        VERIFY_SSL: 'false'
provider: anthropic
model: claude-sonnet-4-20250514
default_agent: healthcare_agent
agents:
  definitions:
  - name: healthcare_agent
    instruction: 'You are a medical research assistant that can search for drug information,

      medical literature, health topics, clinical trials, and medical terminology.

      Be thorough in your research and provide accurate information.

      '
    server_names:
    - health_server
    max_iterations: 8
  - name: full_agent
    instruction: 'You are a comprehensive assistant with access to healthcare data

      and web content fetching capabilities.

      '
    server_names:
    - health_server
    - fetch
    max_iterations: 10
judge:
  provider: anthropic
  model: claude-sonnet-4-20250514
  min_score: 0.8
  max_tokens: 3000
  system_prompt: 'You are an expert medical evaluator. Assess the accuracy, completeness,

    and appropriateness of healthcare-related responses. Consider medical

    accuracy, proper citation of sources, and appropriate disclaimers.

    '
metrics:
  collect:
  - response_time
  - total_duration
  - iteration_count
  - tool_coverage
  - tool_success_rate
  - unique_tools_used
  - unique_servers_used
  - parallel_tool_calls
  - max_concurrent_operations
  - token_usage
  - input_tokens
  - output_tokens
  - cost_estimate
  - llm_time
  - tool_time
  - reasoning_time
  - idle_time
  - error_count
  - error_rate
  - success_rate
  - path_efficiency_score
  - content_extraction_quality
  - error_recovery
reporting:
  formats:
  - json
  - markdown
  output_dir: ./test-reports
  include_traces: true
execution:
  max_concurrency: 5
  timeout_seconds: 300
  retry_failed: true